snappy_pipe_100s/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    topPatch
    {
        type            patch;
        nFaces          9793;
        startFace       863466;
    }
    Wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          76676;
        startFace       873259;
    }
    bottomPatch
    {
        type            patch;
        nFaces          9833;
        startFace       949935;
    }
)

// ************************************************************************* //
